k = 1.38e-23  # постоянная Больцмана Дж/К 
h = 6.6261e-34  # постоянная Планка Дж*с
c = 299792458  # скорость света м/с
mas = {'n2': 28. / 6.022e26, 'o2': 32. / 6.022e26, 'no': 30. / 6.022e26, 'n': 14. / 6.022e26,
    'o': 16. / 6.022e26}  # масса
om_n2 = 235857  # спектроскопическая постоянная N2
om_02 = 158019  # спектроскопическая постоянная O2
om_no = 190420  # спектроскопическая постоянная NO
r = 8.3145  # газовая постоянная смеси Дж*моль^(-1)*K^(-1)
muc = {'n2': 28e-3, 'o2': 32e-3, 'no': 30e-3, 'n': 14e-3, 'o': 16e-3}  # молярная масса кг/моль
