k = 1.38e-23  # постоянная Больцмана Дж/К 
h = 6.6261e-34  # постоянная Планка Дж*с
c = 299792458  # скорость света м/с
mas = {'n2': 28. / 6.022e26, 'o2': 32. / 6.022e26, 'no': 30. / 6.022e26, 'n': 14. / 6.022e26,
    'o': 16. / 6.022e26}  # масса
om_n2 = 235857  # спектроскопичуская постоянная N2
om_02 = 158019  # спектроскопичуская постоянная O2
om_no = 190420  # спектроскопичуская постоянная NO
r = 8.3145  # газовая постоянная смеси Дж*моль^(-1)*K^(-1)
muc = {'n2': 28e-3, 'o2': 32e-3, 'no': 30e-3, 'n': 14e-3, 'o': 16e-3}  # молярная масса кг/моль


# Kap=1+(0.79*m(1)/muc(1)+0.21*m(2)/muc(2))*R/((5/2*k*(0.79+0.21)+f(1)*0.79*m(1)+f(2)*0.21*m(2)))%показатель адиабаты в набегающем потоке
def calc_shockwave(t0: float, m0: int, p0: float) -> (float, float, float):
    n0 = p0 / k / t0  # число частиц в набегающем потоке
    ro0 = 0.79 * n0 * mas['n2'] + 0.21 * n0 * mas['o2']  # плотность в набегающем потоке
    kap = 9 / 7
    t_bsw = t0 * (2 * kap / (kap + 1) * m0 ** 2 - (kap - 1) / (kap + 1)) * (
                2 / (kap + 1) / m0 ** 2 + (kap - 1) / (kap + 1))  # температура за ударной волной
    p_bsw = p0 * (2 * kap / (kap + 1) * m0 ** 2 - (kap - 1) / (kap + 1))  # давление за ударной волной
    n_bsw = p_bsw / k / t_bsw  # число частиц за ударной волной
    m_bsw = (((kap + 1) / 2 / kap) ** 2 / (m0 ** 2 - (kap - 1) ** 2 / 2 / kap) + (
                kap - 1) ** 2 / 2 / kap) ** 0.5  # число маха за ударной волной
    a0 = (kap * p0 / ro0) ** 0.5  # скорость звука в набегающем потоке
    v0 = m0 * a0  # скорость в набегающем потоке
    v_bsw = v0 * (2 / (kap + 1) / m0 ** 2 + (kap - 1) / (kap + 1))  # скорость за ударной волной
    return t_bsw, n_bsw, v_bsw
